src/cf/Documents/_Демо_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>_Демо_Заказ</Name>
			<BasedOn>
				<xr:Item>Catalog._Демо_Контрагенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef._Демо_ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Демо_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Демо_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Enums/кзоМоментыВыполненияПодключаемыхОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>кзоМоментыВыполненияПодключаемыхОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередТиповымОбработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВместоТиповогоОбработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПослеТиповогоОбработчика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/_Демо_Заказ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область КонструкторЗаполненияОбъектов

&НаКлиенте
Функция кзоПолучитьДанныеФормы() Экспорт 
	Возврат кзоПолучитьДанныеФормыНаСервере();	
КонецФункции

&НаСервере
Функция кзоПолучитьДанныеФормыНаСервере()
	Возврат кзоИнтеграция.СоздатьДанныеФормы(ЭтаФорма);	
КонецФункции

&НаСервере
Процедура кзоПодключаемый_ОбработчикНаСервере(СтруктураОбработчика)
	кзоИнтеграция.ВыполнитьОбработчик(ЭтаФорма, СтруктураОбработчика);		
КонецПроцедуры

#Область ПодключаемыеОбработчики

&НаКлиенте
Процедура кзоПодключаемый_ПриИзменении(Элемент)
	
	ИмяЭлемента = Элемент.Имя;
	ИмяСобытия = "ПриИзменении";
	СтруктураОбработчика = кзоИнтеграцияКлиентСервер.НайтиОбработчикВКешеФормы(ЭтаФорма, ИмяЭлемента, ИмяСобытия);
	
	Если СтруктураОбработчика.МоментВыполнения = ПредопределенноеЗначение("Перечисление.кзоМоментыВыполненияПодключаемыхОбработчиков.ВместоТиповогоОбработчика")
		ИЛИ НЕ ЗначениеЗаполнено(СтруктураОбработчика.ТиповойОбработчик)
		Тогда
		кзоПодключаемый_ОбработчикНаСервере(СтруктураОбработчика);
		
	ИначеЕсли СтруктураОбработчика.МоментВыполнения = ПредопределенноеЗначение("Перечисление.кзоМоментыВыполненияПодключаемыхОбработчиков.ПередТиповымОбработчиком") Тогда
		кзоПодключаемый_ОбработчикНаСервере(СтруктураОбработчика);
		Выполнить(СтруктураОбработчика.ТиповойОбработчик);	
		
	ИначеЕсли СтруктураОбработчика.МоментВыполнения = ПредопределенноеЗначение("Перечисление.кзоМоментыВыполненияПодключаемыхОбработчиков.ПослеТиповогоОбработчика") Тогда
		Выполнить(СтруктураОбработчика.ТиповойОбработчик);
		кзоПодключаемый_ОбработчикНаСервере(СтруктураОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кзоПодключаемый_Команда(Команда)
	
	ИмяЭлемента = Команда.Имя;
	ИмяСобытия = "Команда";
	СтруктураОбработчика = кзоИнтеграцияКлиентСервер.НайтиОбработчикВКешеФормы(ЭтаФорма, ИмяЭлемента, ИмяСобытия);
	
	Если СтруктураОбработчика.МоментВыполнения = ПредопределенноеЗначение("Перечисление.кзоМоментыВыполненияПодключаемыхОбработчиков.ВместоТиповогоОбработчика")
		ИЛИ НЕ ЗначениеЗаполнено(СтруктураОбработчика.ТиповойОбработчик)
		Тогда
		кзоПодключаемый_ОбработчикНаСервере(СтруктураОбработчика);
		
	ИначеЕсли СтруктураОбработчика.МоментВыполнения = ПредопределенноеЗначение("Перечисление.кзоМоментыВыполненияПодключаемыхОбработчиков.ПередТиповымОбработчиком") Тогда
		кзоПодключаемый_ОбработчикНаСервере(СтруктураОбработчика);
		Выполнить(СтруктураОбработчика.ТиповойОбработчик);	
		
	ИначеЕсли СтруктураОбработчика.МоментВыполнения = ПредопределенноеЗначение("Перечисление.кзоМоментыВыполненияПодключаемыхОбработчиков.ПослеТиповогоОбработчика") Тогда
		Выполнить(СтруктураОбработчика.ТиповойОбработчик);
		кзоПодключаемый_ОбработчикНаСервере(СтруктураОбработчика);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СтандартныеПодсистемы_ПодключаемыеКоманды

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
    
КонецПроцедуры

#КонецОбласти 

#Область Команды

&НаКлиенте
Процедура ПоказатьСообщение(Команда)
	
	ПоказатьПредупреждение(, "Тестовое сообщение", , "Тест");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// КонструкторЗаполнения.ПодключаемыеКоманды
	кзоИнтеграция.ПриСозданииНаСервере(ЭтаФорма);
	// Конец КонструкторЗаполнения.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ХозяйственнаяОперацияПриИзменении(Элемент)
	Объект.Контрагент = Неопределено;	
КонецПроцедуры

#КонецОбласти
